Зачет/src/Documents/ПутевыеЛисты/ПутевыеЛисты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПутевыеЛисты</name>
  <registerRecords>InformationRegister.ПогрузкаРазгрузка</registerRecords>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Грузоперевозчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Грузоперевозчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйПробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныПробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТопливоЗаправленноеНаПоездку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоСтоянки</name>
    <type>
      <types>EnumRef.МестоСтоянки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипГруза</name>
    <type>
      <types>CatalogRef.ТипыГрузов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРазгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПогрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесПогружаемогоТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Зачет/src/InformationRegisters/ПогрузкаРазгрузка/ПогрузкаРазгрузка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПогрузкаРазгрузка</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВремяРазгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяПогрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесПогружаемогоГруза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Груз</name>
    <type>
      <types>CatalogRef.ТипыГрузов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автоисполнитель</name>
    <type>
      <types>CatalogRef.Грузоперевозчики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Зачет/src/Documents/ПутевыеЛисты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПогрузкаРазгрузка
	Движения.ПогрузкаРазгрузка.Записывать = Истина;
	Движение = Движения.ПогрузкаРазгрузка.Добавить();
	Движение.Груз = ТипГруза;
	Движение.Автоисполнитель = Водитель;
	Движение.Терминал = МестоСтоянки;
	Движение.ВремяРазгрузки = ВремяРазгрузки;
	Движение.ВремяПогрузки = ВремяПогрузки;
	Движение.ВесПогружаемогоГруза = ВесПогружаемогоТовара;
	Движение.Выполнено = Выполнен;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
